//+------------------------------------------------------------------+
//|                                                      Marge.mq4   |
//|                                  Copyright 2025, Никита Сердитов |
//|                                             https://t.me/mashida |
//+------------------------------------------------------------------+
#property copyright   "Copyright 2025, Никита Сердитов"
#property link        "https://t.me/mashida"
#property version     "1.00"
#property strict
#property indicator_chart_window

//--- входные параметры
// input int ExampleParam = 14;

//+------------------------------------------------------------------+
//| Функция инициализации пользовательского индикатора              |
//+------------------------------------------------------------------+
int OnInit()
  {
//---
   return(INIT_SUCCEEDED);
  }
//+------------------------------------------------------------------+
//| Функция деинициализации пользовательского индикатора            |
//+------------------------------------------------------------------+
void OnDeinit(const int reason)
  {
//---
  }
//+------------------------------------------------------------------+
//| Функция итерации пользовательского индикатора                   |
//+------------------------------------------------------------------+
int OnCalculate(const int rates_total,
                const int prev_calculated,
                const datetime &time[],
                const double &open[],
                const double &high[],
                const double &low[],
                const double &close[],
                const long &tick_volume[],
                const long &volume[],
                const int &spread[])
  {
//---
   return(rates_total);
  }
//+------------------------------------------------------------------+ 